# Letters


## 【题目描述】

柏林大学有n幢公寓楼，依次用1~n编号，每幢公寓楼由一系列房间组成，假设第i幢公寓楼有$a_i$个房间，分别用1~$a_i$编号。

有一个快递员要送信到一个房间，但是信封上却没有写明需要送到第几幢第几个房间，只有这个房间在所有房间中的编号（从第一幢楼第一个房间依次编号）。

现在有m个信封，每个信封上只有需要送到的房间在所有房间中的编号。问这个房间位于第几幢公寓楼的第几个房间。

举个例子，如果n=2，$a_1$=3,$a_2$=5,信封上的编号可以是1~8,如果写着7,那么就代表需要送到第2幢公寓楼的第4个房间。

**【输入格式】**

第一行两个整数`n`，`m`，表示公寓楼数量和信封数量。

第二行n个整数$a_i$,表示第i幢公寓楼的房间数量。

第三行m个整数$b_j$,表示第j个信封上的编号。保证给出的$b_j$是递增的。


**【输出格式】**

对于每个信封的数字输出一行，每行两个数字f,k，用空格隔开，表示需要送到第f幢公寓楼的第k个房间。

**【输入样例】**

  3 6
	10 15 12
	1 9 12 23 26 37

**【输出样例】**

  1 1
	1 9
	2 2
	2 13
	3 1
	3 12
    
**【数据范围】**
- 1<=n,m<=2*10^5
- 1<=$a_i<=10^10
- 1<=$b_j<=$a_1$+$a_2$+...+$a_n$

**【测试网站】**

[codeforces](https://codeforces.com/contest/978/problem/C)

## 题目分析
   
   

**【代码示例】**
```c++


```

   
   
   
